Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: You can get the full changelogs of https://github.com/quarkusio/quarkus/releases/tag/2.2.0.CR1[2.2.0.CR1], https://github.com/quarkusio/quarkus/releases/tag/2.2.0.Final[2.2.0.Final] and https://github.com/quarkusio/quarkus/releases/tag/2.2.1.Final[2.2.1.Final] on GitHub.
ja_jp: link:https://github.com/quarkusio/quarkus/releases/tag/2.2.0.CR1[2.2.0.CR1]、 link:https://github.com/quarkusio/quarkus/releases/tag/2.2.0.Final[2.2.0.Final]、 link:https://github.com/quarkusio/quarkus/releases/tag/2.2.1.Final[2.2.1.Final]の完全な変更履歴はGitHubでご覧いただけます。

source: You can get the full changelogs of the various intermediary versions that lead to this Final on GitHub:
ja_jp: 今回のFinalに至るまでの様々な中間バージョンの完全な変更履歴はGitHubで入手できます。

source: You can go back to the previous behavior by adding the `@Dependent` annotation to your GraphQL endpoints.
ja_jp: GraphQLエンドポイントに `@Dependent` アノテーションを追加することで、以前の動作に戻すことができます。

source: You can go further, and supply your own `style.css`, to fine-tune the branding. As an example, to change the `topbar` of the Swagger UI screen to fit the corporate colors of ACME:
ja_jp: さらに、独自の `style.css` を提供して、ブランディングを微調整することもできます。例として、Swagger UI画面の `topbar` を ACME のコーポレートカラーに合わせて変更することができます。

source: You can go one step further and proactively refresh ID tokens or access tokens that are about to expire. Set `quarkus.oidc.token.refresh-token-time-skew` to the value you want to anticipate the refresh.
ja_jp: さらに一歩進んで、期限切れが近づいている ID トークンまたはアクセストークンを事前に更新することもできます。 `quarkus.oidc.token.refresh-token-time-skew` を、更新を予測する値に設定します。

source: You can go one step further and proactively refresh ID tokens or access tokens that are about to expire. Set `quarkus.oidc.token.refresh-token-time-skew` to the value you want to anticipate the refresh. If, during the current user request, it is calculated that the current ID token will expire within this `quarkus.oidc.token.refresh-token-time-skew`, then it is refreshed, and the new session cookie is created. This property should be set to a value that is less than the ID token lifespan; the closer it is to this lifespan value, the more often the ID token is refreshed.
ja_jp: さらに一歩進んで、期限切れが近づいている ID トークンまたはアクセストークンを事前に更新することもできます。 `quarkus.oidc.token.refresh-token-time-skew` を、更新を予測する値に設定します。 現在のユーザーリクエスト中に、現在の ID トークンがこの `quarkus.oidc.token.refresh-token-time-skew` 内に期限切れになると計算された場合、トークンは更新され、新しいセッションクッキーが作成されます。 このプロパティーは、ID トークンの有効期間よりも短い値に設定する必要があります。この有効期間の値に近いほど、ID トークンの更新頻度が高くなります。

source: You can go right to the completed example.
ja_jp: 完成した例に進むことができます。

source: You can go to https://kiegroup.github.io/kogito-online/#/download[Business Modeler Hub] to download the latest platforms supported for the https://github.com/kiegroup/kogito-tooling/releases[Kogito tooling releases].
ja_jp: link:https://kiegroup.github.io/kogito-online/#/download[Business Modeler Hub]では、link:https://github.com/kiegroup/kogito-tooling/releases[Kogito toolingリリース]でサポートされている最新のプラットフォームをダウンロードすることができます。

source: You can group your request parameters in a container class instead of declaring them as method parameters to you endpoint, so we can rewrite the previous example like this:
ja_jp: リクエストパラメータをメソッドパラメータとしてエンドポイントに宣言する代わりに、コンテナクラスでまとめることができます。したがって、前の例を次のように書き換えることができます。

source: You can have Quarkus OIDC `web-app` applications access **Google Cloud services** such as **BigQuery** on behalf of the currently authenticated users who have enabled OIDC authorization code flow permissions to such services in their Google developer consoles.
ja_jp: Google Developer Consoles の **BigQuery** などの **Google Cloud Services** に対して OIDC 認可コードフロー権限を有効化している現在認証済みのユーザーに代わり、Quarkus OIDC `web-app` アプリケーションが、それらのサービスにアクセスできるようにすることが可能です。

source: You can have Quarkus OIDC `web-app` applications access **Google Cloud services** such as **BigQuery** on behalf of the currently authenticated users who have enabled OpenID Connect (Authorization Code Flow) permissions to such services in their Google Developer Consoles.
ja_jp: Quarkus OIDC `web-app` アプリケーションは、Google Developer Consolesで *BigQuery* などのサービスに対するOpendId Connect(Authorization Code Flow)パーミッションを有効にしている現在認証されたユーザーに代わって、 *BigQuery* などの *Google Cloudサービスに* アクセスすることができます。

source: You can have a single filter intercept requests to all OIDC provider endpoints, or use an `@OidcEndpoint` annotation to apply this filter to requests to specific endpoints only.
ja_jp: すべての OIDC プロバイダーエンドポイントへのリクエストをインターセプトする単一のフィルターを設定することも、 `@OidcEndpoint` アノテーションを使用してこのフィルターを特定のエンドポイントへのリクエストにのみ適用することもできます。

source: You can have a single filter intercept responses to all OIDC client requests, or use an `@OidcEndpoint` annotation to apply this filter to responses to specific OIDC client requests only.
ja_jp: すべての OIDC クライアント要求への応答をインターセプトする単一のフィルターを使用することも、 `@OidcEndpoint` アノテーションを使用して、このフィルターを特定の OIDC クライアント要求への応答にのみ適用することもできます。

source: You can have a single filter intercepting all the OIDC registration and registered client requests, or use an `@OidcEndpoint` annotation to apply this filter to either OIDC registration or registered client endpoint responses only. For example:
ja_jp: すべての OIDC 登録と登録済みクライアントリクエストをインターセプトする単一のフィルターを使用することも、 `@OidcEndpoint` アノテーションを使用してこのフィルターを OIDC 登録または登録済みクライアントエンドポイントレスポンスのみに適用することもできます。次に例を示します。

source: You can have a single filter intercepting all the OIDC responses, or use an `@OidcEndpoint` annotation to apply this filter to the specific endpoint responses only. For example:
ja_jp: すべての OIDC レスポンスをインターセプトする単一のフィルターを使用することも、 `@OidcEndpoint` アノテーションを使用してこのフィルターを特定のエンドポイントレスポンスにのみ適用することもできます。例:

source: You can have a single filter intercepting requests to all OIDC provider endpoints, or use an `@OidcEndpoint` annotation to apply this filter to requests to specific endpoints only. For example:
ja_jp: すべての OIDC プロバイダーエンドポイントへのリクエストをインターセプトする単一のフィルターを使用することも、 `@OidcEndpoint` アノテーションを使用してこのフィルターを特定のエンドポイントへのリクエストにのみ適用することもできます。例:

source: You can have a single filter intercepting responses to all OIDC client requests, or use an `@OidcEndpoint` annotation to apply this filter to the responses to the specific OIDC client requests only. For example:
ja_jp: すべての OIDC クライアント要求への応答をインターセプトする単一のフィルターを使用することも、 `@OidcEndpoint` アノテーションを使用して、このフィルターを特定の OIDC クライアント要求への応答にのみ適用することもできます。例:

source: You can have a single filter intercepting responses to all the OIDC registration and registered client requests, or use an `@OidcEndpoint` annotation to apply this filter to responses from either OIDC registration or registered client endpoint only. For example:
ja_jp: すべての OIDC 登録および登録済みクライアントリクエストへのレスポンスをインターセプトする単一のフィルターを使用することも、 `@OidcEndpoint` アノテーションを使用してこのフィルターを OIDC 登録または登録済みクライアントエンドポイントからのレスポンスにのみ適用することもできます。次に例を示します。

source: You can have as many query as you want and for each of them it will be generated a different REST endpoint with the same name of the query transformed from camel case (like `FindApproved`) to dash separated (like `find-approved`).
ja_jp: 必要な数のクエリーを作成でき、クエリーごとに、キャメルケース (`FindApproved` など) からダッシュ区切り (`find-approved` など) に変換された同じクエリー名を持つ異なる REST エンドポイントが生成されます。

source: You can have producers and consumers using both formats in the same Apicurio Registry instance, but not mixing them in the same topic.
ja_jp: 同じ Apicurio Registry インスタンスで両方の形式を使用するプロデューサーとコンシューマーを持つことはできますが、同じトピック内でそれらを混在させることはできません。

source: You can have the test front-end endpoint, which uses the injected MP REST client with a registered OidcClient filter, call the downstream endpoint. This endpoint echoes the token back. For example, see the `integration-tests/oidc-client-wiremock` in the `main` Quarkus repository.
ja_jp: 登録された OidcClient フィルターを使用して注入された MP REST クライアントを使用するテストフロントエンドエンドポイントで、ダウンストリームエンドポイントを呼び出すことができます。このエンドポイントはトークンをエコーバックします。たとえば、Quarkus の `main` リポジトリーにある `integration-tests/oidc-client-wiremock` を参照してください。

source: You can have this process further optimized by having a simple JavaScript function periodically emulating the user activity by pinging your Quarkus endpoint thus minimizing the window during which the user may have to be re-authenticated.
ja_jp: シンプルな JavaScript 関数が、Quarkus エンドポイントへの ping 送信によってユーザーの活動を定期的にエミュレートし、ユーザーが再認証されるウィンドウを最小限に抑えることで、このプロセスをさらに最適化することができます。

source: You can have this provider registered as described in the xref:security-customization.adoc#bouncy-castle[BouncyCastle] or xref:security-customization.adoc#bouncy-castle-fips[BouncyCastle FIPS] sections.
ja_jp: link:security-customization.html#bouncy-castle[BouncyCastle]または link:security-customization.html#bouncy-castle-fips[BouncyCastle FIPS]のセクションで説明したように、このプロバイダーを登録させることができます。

source: You can have your projection class extends from another class. In this case, the parent class also needs to have use `@ProjectionFor` annotation.
ja_jp: 射影クラスが他のクラスを継承している場合があります。この場合、親クラスも `@ProjectionFor` アノテーションを持つ必要があります。

source: You can hit refresh a couple more times. After 2 requests within a 10 second interval you should start seeing errors in the logs, similar to these:
ja_jp: さらに数回更新を押すことができます。10 秒間隔で 2 回のリクエストを実行すると、ログに次のようなエラーが表示されるようになります。

source: You can hit refresh couple more times. Practically all requests should now be succeeding. The `CoffeeResource#coffees()` method is still in fact failing in about 50 % of time, but every time it happens, the platform will automatically retry the call!
ja_jp: もう何度か更新ボタンを押してください。実質的にすべてのリクエストが成功しているはずです。 `CoffeeResource#coffees()` メソッドは、実際にはまだ約 50% の時間で失敗していますが、そのたびにプラットフォームは自動的に呼び出しを再試行します!

source: You can implement a gRPC server interceptor by creating an `@ApplicationScoped` bean implementing `io.grpc.ServerInterceptor`:
ja_jp: `io.grpc.ServerInterceptor` を実装した `@ApplicationScoped` Beanを作成することで、gRPC サーバーのインターセプターを実装できます。

source: You can implement integration tests using `@QuarkusIntegrationTest` functionality. When these integration tests run, the local Azure Functions environment will be spun up for the duration of integration testing.
ja_jp: `@QuarkusIntegrationTest` の機能を使用して統合テストを実装できます。これらの統合テストが実行されると、 統合テストの間、ローカルの Azure Functions 環境がスピンアップされます。

source: You can import Classes and/or functions from other libraries. In this case, we use the `LitElement` class and `html` & `css` functions from `Lit`
ja_jp: 他のライブラリーからクラスや関数をインポートできます。 その場合、 `Lit` の `LitElement` クラスと `html` および `css` 関数を使用します。

source: You can import it as a static import to simplify your code:
ja_jp: 静的インポートとしてインポートすることで、コードを簡単にすることができます：

source: You can inject Hibernate Search's main entry point, `SearchMapping`, using CDI:
ja_jp: CDI を使用して、Hibernate Search のメインエントリーポイントである `SearchMapping` を注入できます。

source: You can inject Hibernate Search's main entry points, `SearchSession` and `SearchMapping`, using CDI:
ja_jp: CDI を使用して、Hibernate Search のメインエントリーポイント `SearchSession` と `SearchMapping` をインジェクションすることができます:

source: You can inject `Tokens` that use `OidcClient` internally. `Tokens` can be used to acquire the access tokens and refresh them if necessary:
ja_jp: 内部で `OidcClient` を使用する `Tokens` を注入できます。 `Tokens` はアクセストークンを取得し、必要に応じて更新するために使用できます。

source: You can inject `Tokens` which uses `OidcClient` internally. `Tokens` can be used to acquire the access tokens and refresh them if necessary:
ja_jp: 内部で `OidcClient` を使用する `Tokens` を注入することができます。 `Tokens` を使用してアクセストークンを取得し、必要に応じて更新することができます。

source: You can inject a `SecurityIdentity` instance for every authenticated resource to get the authenticated identity information.
ja_jp: 認証されたリソースごとに `SecurityIdentity` インスタンスを注入することで、認証された ID 情報を取得することができます。

source: You can inject an `executor` if you use the Context Propagation extension:
ja_jp: Context Propagation エクステンションを利用することで、 `executor` を注入することができます。

source: You can inject either the:
ja_jp: 以下のどちらかを注入することができます。

source: You can inject other CDI beans to access keystore material at runtime.
ja_jp: 他の CDI Bean を注入して、実行時にキーストアマテリアルにアクセスできます。

source: You can inject other CDI beans to access truststore material at runtime.
ja_jp: 他の CDI Bean を注入して、実行時にトラストストアマテリアルにアクセスできます。

source: You can inject the `EntityManagerFactory` of a named persistence unit using the exact same mechanism:
ja_jp: まったく同じ仕組みで名前付き永続化ユニットの `EntityManagerFactory` を注入できます。

source: You can inject the `SearchMapping` of a named persistence unit using the exact same mechanism:
ja_jp: 全く同じメカニズムを使って、名前付き永続化ユニットの `SearchMapping` をインジェクションすることができます:

source: You can inject the mailer in your application using:
ja_jp: 次のようにしてアプリケーションにMailerをインジェクトすることができます:

source: You can inject these classes in any CDI enabled bean. For instance, the `Tracer` is particularly useful to start custom spans:
ja_jp: これらのクラスは、CDIが有効なBeanに注入することができます。例えば、 `Tracer` は、カスタムスパンを開始するために特に有用です。

source: You can install a JDK with `brew install openjdk` for Java 17 or `brew install openjdk@11` for Java 11.
ja_jp: JDK は、Java 17 の場合は `brew install openjdk` を使用して、Java 11 の場合は `brew install openjdk@11` を使用してインストールできます。

source: You can install a JDK with `brew install openjdk` for the latest Java version, `brew install openjdk@17` for Java 17, or `brew install openjdk@11` for Java 11.
ja_jp: JDKのインストールは、最新のJavaバージョンなら `brew install openjdk` 、Java 17なら `brew install openjdk@17` 、Java 11なら `brew install openjdk@11` で行うことができます。

source: You can install a JDK with `brew install openjdk` for the latest Java version, `brew install openjdk@17` for Java 17, or `brew install openjdk@21` for Java 21.
ja_jp: 最新のJavaバージョンの場合、 `brew install openjdk` 、Java 17用の場合、 `brew install openjdk@17` 、Java 21用の場合、 `brew install openjdk@21` でJDKをインストールすることが出来ます。

source: You can install a JDK with `choco install ojdkbuild17` for Java 17 or `choco install ojdkbuild11` for Java 11.
ja_jp: JDK は、Java 17 の場合は `choco install ojdkbuild17`、Java 11 の場合は `choco install ojdkbuild11` を使用してインストールできます。

source: You can install a JDK with `choco install temurin17` for Java 17 or `choco install temurin21` for Java 21.
ja_jp: Java 17の場合、 `choco install temurin17` あるいはJava 21の場合、 `choco install temurin21` でJDKをインストールできます。

source: You can install all extensions which match a glob pattern:
ja_jp: glob パターンに一致するすべてのエクステンションをインストールできます。

source: You can install all extensions which match a globbing pattern :
ja_jp: グロブパターンに一致するすべてのエクステンションをインストールすることができます。

source: You can install all extensions which match a globbing pattern:
ja_jp: グロブパターンに一致するエクステンションをすべてインストールすることができます。

source: You can install an executable jar as a plugin via Maven coordinates.
ja_jp: Maven 座標を介して実行可能な jar をプラグインとしてインストールできます。

source: You can invoke on this using an HTTP GET and query parameters:
ja_jp: HTTP GET とクエリパラメーターを使用して呼び出すことができます。

source: You can invoke the `hello` function defined in link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] by pointing your browser to http://localhost:8080/hello
ja_jp: ブラウザで http://localhost:8080/hello を開くことで、 link:{quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] で定義されている `hello` 関数を呼び出すことが出来ます。

source: You can invoke the `hello` function defined in {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] by pointing your browser to http://localhost:8080/hello
ja_jp: ブラウザを http://localhost:8080/hello に向けると、 {quickstarts-tree-url}/funqy-quickstarts/funqy-http-quickstart/src/main/java/org/acme/funqy/PrimitiveFunctions.java[PrimitiveFunctions.java] で定義されている `hello` Function を呼び出すことができます。

source: You can invoke the assistant from backend code using xref:dev-ui.adoc#communicating-to-the-backend[standard Dev UI JSON-RPC] patterns — both against the *runtime* and *deployment* classpaths.
ja_jp: *ランタイム* および *デプロイメント* クラスパスの両方に対して、 xref:dev-ui.adoc#communicating-to-the-backend[標準的な Dev UI JSON-RPC] パターンを使用してバックエンドコードからアシスタントを呼び出すことができます。

source: You can iterate over elements of an array with <<loop_section>>. Moreover, it's also possible to get the length of the specified array and access the elements directly via an index value. Additionally, you can access the first/last `n` elements via the `take(n)/takeLast(n)` methods.
ja_jp: <<loop_section>> を使用して、配列の要素を反復処理することができます。 また、指定した配列の長さを取得し、インデックス値を用いて直接要素にアクセスすることも可能です。 さらに、`take(n)/takeLast(n)` メソッドを使用して最初または最後の `n` 要素にアクセスできます。

source: You can iterate over elements of an array with the <<loop_section>>. Moreover, it's also possible to get the length of the specified array and access the elements directly via an index value. Additionally, you can access the first/last `n` elements via the `take(n)/takeLast(n)` methods.
ja_jp: <<loop_section>> を使用して、配列の要素を反復処理することができます。また、指定した配列の長さを取得し、インデックス値を用いて直接要素にアクセスすることも可能です。さらに、 `take(n)/takeLast(n)` メソッドを用いると、最初と最後の `n` 要素にアクセスすることができます。

source: You can iterate over elements of an array with the <<loop_section>>. Moreover, it's also possible to get the length of the specified array and access the elements directly via an index value. Additionaly, you can access the first/last `n` elements via the `take(n)/takeLast(n)` methods.
ja_jp: 配列の要素を繰り返し処理するには、 <<loop_section>> を使用します。 さらに、指定した配列の長さを取得したり、インデックス値を使用して要素に直接アクセスしたりすることも可能です。さ らに、 `take(n)/takeLast(n)` メソッドを使用すると、最初/最後の `n` 要素にアクセスできます。

source: You can iterate over elements of an array with xref:loop_section[Loop Section]. Moreover, it's also possible to get the length of the specified array and access the elements directly via an index value. Additionally, you can access the first/last `n` elements via the `take(n)/takeLast(n)` methods.
ja_jp: xref:loop_section[ループセクション] を使えば、配列の要素に対して反復処理を行うことができます。また、指定した配列の長さを取得し、インデックス値で要素に直接アクセスすることも可能です。さらに、 `take(n)/takeLast(n)` メソッドにより、最初/最後の `n` 要素にアクセスすることができます。

source: You can keep a UI screen updated with the latest data by continuously streaming data to the screen. This can be done with `Multi` (Java side) and `Observer` (Javascript side)
ja_jp: データを継続的に画面にストリーミングすることで、UI 画面を最新のデータで更新することができます。これは、 `Multi` (Java 側) と `Observer` (Javascript 側) で実行できます。

source: You can learn more about https://chicory.dev/docs/[Chicory], but from now on let's focus on its Quarkus extension, here. :-)
ja_jp: https://chicory.dev/docs/[Chicory] についての詳細を確認できますが、ここからはその Quarkus エクステンションに焦点を当てましょう。

source: You can learn more about it in http://quarkus.io/guides/cache#programmatic-api[the dedicated section of the guide].
ja_jp: link:http://quarkus.io/guides/cache#programmatic-api[ガイドの専用セクション]で詳しく説明しています。

source: You can learn more about it in link:/blog/using-lra[the dedicated blog post].
ja_jp: 詳しくは link:/blog/using-lra[専用のブログ記事]でご紹介しています。

source: You can learn more about it in the <<upgrading>> section.
ja_jp: <<upgrading>> のセクションで詳しく解説しています。

source: You can learn more about it in the link:/guides/writing-extensions#build-step-processors[Writing extensions guide].
ja_jp: link:/guides/writing-extensions#build-step-processors[Writing extensionsガイド]で詳しく解説しています。

source: You can learn more about the Elasticsearch analysis framework in the https://www.elastic.co/guide/en/elasticsearch/reference/current/analysis.html[Analysis section of the Elasticsearch documentation].
ja_jp: Elasticsearchアナリシスフレームワークについては、 link:https://www.elastic.co/guide/en/elasticsearch/reference/current/analysis.html[ElasticsearchドキュメントのText analysis セクション] で詳しく説明しています。

source: You can learn more in the https://quarkus.io/guides/aot[Quarkus AOT guide], and we'll share a detailed walkthrough in the upcoming blog post.
ja_jp: 詳細については、 https://quarkus.io/guides/aot[Quarkus AOT ガイド]を参照してください。近日公開のブログ記事で、詳細なチュートリアルを共有します。

source: You can listen to other security events as described in the xref:security-customization.adoc#observe-security-events[Observe security events] section of the Security Tips and Tricks guide.
ja_jp: 「セキュリティのヒントとコツ」ガイドの xref:security-customization.adoc#observe-security-events[セキュリティイベントの監視] セクションで説明されているように、他のセキュリティイベントを聞くことができます。

source: You can log in to an {openshift} cluster by using the OpenShift CLI (`oc`). For more information, see link:https://docs.openshift.com/container-platform/4.18/cli_reference/openshift_cli/getting-started-cli.html[Getting started with the OpenShift CLI]:
ja_jp: OpenShift CLI ( `oc` ) を使用して {openshift} クラスタにログインできます。 詳細については、 link:https://docs.openshift.com/container-platform/4.18/cli_reference/openshift_cli/getting-started-cli.html[OpenShift CLIを使い始める] を参照してください：

source: You can make use of the Undertow predicate language using an `undertow-handlers.conf` file. This file should be placed in the `META-INF` directory of your application jar. This file contains handlers defined using the link:http://undertow.io/undertow-docs/undertow-docs-2.0.0/index.html#predicates-attributes-and-handlers[Undertow predicate language].
ja_jp: `undertow-handlers.conf` ファイルを使用することで、Undertow 述語言語を利用することができます。このファイルは、アプリケーション jar の `META-INF` ディレクトリーに配置する必要があります。このファイルには、Undertow link:http://undertow.io/undertow-docs/undertow-docs-2.0.0/index.html#predicates-attributes-and-handlers[述語言語] を使用して定義されたハンドラーが含まれています。

source: You can make use of the Undertow predicate language using an `undertow-handlers.conf` file. This file should be placed in the `META-INF` directory of your application jar. This file contains handlers defined using the link:https://undertow.io/undertow-docs/undertow-docs-2.0.0/index.html#predicates-attributes-and-handlers[Undertow predicate language].
ja_jp: `undertow-handlers.conf` ファイルを使用することで、 Undertow 述語言語を利用することができます。このファイルは、アプリケーション jar の `META-INF` ディレクトリーに配置する必要があります。このファイルには、link:https://undertow.io/undertow-docs/undertow-docs-2.0.0/index.html#predicates-attributes-and-handlers[Undertow 述語言語] を使用して定義されたハンドラーが含まれています。

source: You can make your extension support the xref:dev-ui.adoc[Quarkus Dev UI] for a greater developer experience.
ja_jp: エクステンションを link:dev-ui.html[Quarkus Dev UI]に対応させることで、開発者の利便性を高めることができます。

source: You can map `SecurityIdentity` roles from the verified JWT access tokens as follows:
ja_jp: `SecurityIdentity` ロールは、次のように、検証済みの JWT アクセストークンからマッピングすることができます。

source: You can mark a context _safe_. It is meant for other extensions to integrate with to help identify which contexts are isolated and guarantee access by a unique thread. Hibernate Reactive uses this feature to check if the current context is safe to store the currently opened session to protect users from mistakenly interleaving multiple reactive operations that could unintentionally share the same session.
ja_jp: コンテキストに _セーフ_ マークをつけることができます。 これは、他のエクステンションがどのコンテキストが隔離されているかを識別し、固有のスレッドによるアクセスを保証するために統合するためのものです。 Hibernate Reactive はこの機能を使用して、現在開いているセッションを保存するために現在のコンテキストが安全かどうかをチェックし、意図せず同じセッションを共有する可能性のある複数のリアクティブ操作を誤ってインターリーブすることからユーザーを保護します。

source: You can mix Blocking and Non-blocking in one request,
ja_jp: BlockingとNon-blockingを1つのリクエストに混ぜることができます。

source: You can mix the default datasource and named datasources or only have one or the other.
ja_jp: デフォルトデータソースと名前付きデータソースを混在させることも、どちらか一方だけにすることもできます。

source: You can narrow the score of the storage further by the current application:
ja_jp: ストレージのスコープを現在のアプリケーションによってさらに絞り込むことができます:

source: You can now configure your `application.properties`:
ja_jp: これで、 `application.properties` を設定できます。

source: You can now copy your `Client ID` and `Client Secret` and press `Done`:
ja_jp: これで、 `Client ID` および `Client Secret` をコピーして `Done` を押すことができます。

source: You can now create a `KogitoScenarioJunitActivatorTest.java` class file in the `src/test/java/testscenario` directory:
ja_jp: これで、 `src/test/java/testscenario` ディレクトリに `KogitoScenarioJunitActivatorTest.java` クラスファイルを作成することができます:

source: You can now create a `PricingTest.scesim` file in the `src/test/resources` directory:
ja_jp: これで、 `src/test/resources` ディレクトリに `PricingTest.scesim` ファイルを作成することができます:
